Revit 2027 API
ParameterTypeId.SlantedColumnBaseCutStyle Property
 "Base Cut Style"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SlantedColumnBaseCutStyle { get; }
Public Shared ReadOnly Property SlantedColumnBaseCutStyle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SlantedColumnBaseCutStyle {
	ForgeTypeId^ get ();
}
static member SlantedColumnBaseCutStyle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace